___

<img src='download.png'/>
___

In [ ]:
## Importing pandas

In [82]:
import pandas as pd
import numpy as np

## To create a DataFrame in Pandas from a dict

In [83]:
data={'movie':['titanic','kill bill','narnia','harry potter'],'year':[1997,2003,2005,2002],'rating':[4.3,4.5,4.0,4.6]}
df=pd.DataFrame(data)
df

          movie  year  rating
0       titanic  1997     4.3
1     kill bill  2003     4.5
2        narnia  2005     4.0
3  harry potter  2002     4.6

## Accesing last and first rows of DataFrame

In [84]:
df.head(2)

       movie  year  rating
0    titanic  1997     4.3
1  kill bill  2003     4.5

In [85]:
df.tail(2)

          movie  year  rating
2        narnia  2005     4.0
3  harry potter  2002     4.6

## Rename index / columns names (labels) of DataFrame

In [86]:
df_new = df.rename(columns={'movie': 'Title','year':'release year','rating':'stars'}, index={0:'movie one',1:'movie two',2:'movie three',3:'movie four'})
df_new

                    Title  release year  stars
movie one         titanic          1997    4.3
movie two       kill bill          2003    4.5
movie three        narnia          2005    4.0
movie four   harry potter          2002    4.6

## Access the Columns in Pandas DataFrame

In [87]:
df_new['Title']

movie one           titanic
movie two         kill bill
movie three          narnia
movie four     harry potter
Name: Title, dtype: object

##  Access columns as an attribute

In [88]:
df_new.stars

movie one      4.3
movie two      4.5
movie three    4.0
movie four     4.6
Name: stars, dtype: float64

## Access the Rows in DataFrames

In [89]:
df_new.loc['movie one']

Title           titanic
release year       1997
stars               4.3
Name: movie one, dtype: object

In [90]:
df_new.loc['movie four']

Title           harry potter
release year            2002
stars                    4.6
Name: movie four, dtype: object

### Let’s create a second DataFrame and this time, in the column attribute, let’s add a column that was not present in our dictionary.

In [91]:
df_new['My new columns']='default'
df_new

                    Title  release year  stars My new columns
movie one         titanic          1997    4.3        default
movie two       kill bill          2003    4.5        default
movie three        narnia          2005    4.0        default
movie four   harry potter          2002    4.6        default

## if you want to add the new column at certain index

In [92]:
df_new

                    Title  release year  stars My new columns
movie one         titanic          1997    4.3        default
movie two       kill bill          2003    4.5        default
movie three        narnia          2005    4.0        default
movie four   harry potter          2002    4.6        default

#### if you want to specify the order of the column

In [93]:
df_new.insert(1, 'My 2nd new column', 'default value 2')
df_new

,Title,My 2nd new column,release year,stars,My new columns
movie one,titanic,default value 2,1997,4.3,default
movie two,kill bill,default value 2,2003,4.5,default
movie three,narnia,default value 2,2005,4.0,default
movie four,harry potter,default value 2,2002,4.6,default

#### A cool feature of Pandas is that you assign a column with a certain constant value.

In [94]:
df_new['My 2nd new column']='human'
df_new

,Title,My 2nd new column,release year,stars,My new columns
movie one,titanic,human,1997,4.3,default
movie two,kill bill,human,2003,4.5,default
movie three,narnia,human,2005,4.0,default
movie four,harry potter,human,2002,4.6,default

#### We can also map series onto a column in a DataFrame.

In [96]:
ser=pd.Series([2,3,],index=[1,3])
df_new['My new columns']=ser
df_new

,Title,My 2nd new column,release year,stars,My new columns
movie one,titanic,human,1997,4.3,NaN
movie two,kill bill,human,2003,4.5,NaN
movie three,narnia,human,2005,4.0,NaN
movie four,harry potter,human,2002,4.6,NaN

## Delete Columns in Pandas DataFrame

In [98]:
del df_new['My new columns']
df_new

                    Title My 2nd new column  release year  stars
movie one         titanic             human          1997    4.3
movie two       kill bill             human          2003    4.5
movie three        narnia             human          2005    4.0
movie four   harry potter             human          2002    4.6

## Delete Rows in Pandas DataFrame

In [99]:
df_new.drop(['movie one'])

                    Title My 2nd new column  release year  stars
movie two       kill bill             human          2003    4.5
movie three        narnia             human          2005    4.0
movie four   harry potter             human          2002    4.6

## DataFrame with Nested Dictionaries

In [101]:
dicty={'friends age':{'charan':20,'sri sai':20,'vijay':22,'poojitha':20},'teachers age':{'col ranjith sinha':55,'chandan':44,'shivangi goel':25}}
df_n3=pd.DataFrame(dicty)
df_n3

                   friends age  teachers age
charan                    20.0           NaN
sri sai                   20.0           NaN
vijay                     22.0           NaN
poojitha                  20.0           NaN
col ranjith sinha          NaN          55.0
chandan                    NaN          44.0
shivangi goel              NaN          25.0

## Transpose Pandas DataFrames

In [102]:
df_n3.T

,charan,sri sai,vijay,poojitha,col ranjith sinha,chandan,shivangi goel
friends age,20.0,20.0,22.0,20.0,NaN,NaN,NaN
teachers age,NaN,NaN,NaN,NaN,55.0,44.0,25.0

## Iterating over the Rows and Columns of Dataframe

In [106]:
 dat_new= { 'fruit': ["Guava", "Apple", "Oranges"], 'price':[40, 120, 60]}

In [112]:
data_df= pd.DataFrame(dat_new)
data_df

     fruit  price
0    Guava     40
1    Apple    120
2  Oranges     60

In [113]:
for i,j in data_df.iterrows():
    print(i,j)
    print()

0 fruit    Guava
price       40
Name: 0, dtype: object

1 fruit    Apple
price      120
Name: 1, dtype: object

2 fruit    Oranges
price         60
Name: 2, dtype: object

## Stacking and Unstacking of DataFrames

In [108]:
data_st=data_df.stack()
data_st

0  fruit      Guava
   price         40
1  fruit      Apple
   price        120
2  fruit    Oranges
   price         60
dtype: object

In [110]:
data_unst=data_df.unstack()
data_unst

fruit  0      Guava
       1      Apple
       2    Oranges
price  0         40
       1        120
       2         60
dtype: object

## Setting a List as an Index in Pandas DataFrames

In [114]:
data_df

     fruit  price
0    Guava     40
1    Apple    120
2  Oranges     60

In [115]:
id=['one','two','three']
data_df.index=id
data_df

         fruit  price
one      Guava     40
two      Apple    120
three  Oranges     60

#### Selecting values from a DataFrame according to index

In [117]:
data_df.loc['two']

fruit    Apple
price      120
Name: two, dtype: object

## Working with Missing Values

In [118]:
datamiss_dict={'Data':[1, np.nan, 8, 9, np.nan], 'name':["charan","mike","vj","nandy","vikram"]}
datamiss_a= pd.DataFrame(datamiss_dict)
datamiss_a

   Data    name
0   1.0  charan
1   NaN    mike
2   8.0      vj
3   9.0   nandy
4   NaN  vikram

In [119]:
datamiss_a.isnull()

    Data   name
0  False  False
1   True  False
2  False  False
3  False  False
4   True  False

In [121]:
datamiss_a.fillna('Not available')

            Data    name
0              1  charan
1  Not available    mike
2              8      vj
3              9   nandy
4  Not available  vikram

## We can drop all data which is missing using .dropna() function

In [122]:
datamiss_a.dropna()

   Data    name
0   1.0  charan
2   8.0      vj
3   9.0   nandy